// tailwind.config.js
module.exports = {
  // استفاده از 'class' برای کنترل دارک مود
  darkMode: 'class', // 'class' یا 'media' 
  content: [
    "./src/**/*.{js,jsx,ts,tsx}",  // مسیر برای فایل‌های جاوا اسکریپت و تایپ اسکریپت
  ],
  theme: {
    extend: {
      // می‌توانید رنگ‌ها، فونت‌ها، فاصله‌ها و دیگر ویژگی‌ها را اینجا اضافه کنید
      colors: {
        dark: {
          background: '#121212',  // رنگ پس‌زمینه برای دارک مود
          text: '#ffffff',        // رنگ متن برای دارک مود
        },
        light: {
          background: '#ffffff',  // رنگ پس‌زمینه برای لایت مود
          text: '#000000',        // رنگ متن برای لایت مود
        },
      },
      // سایر ویژگی‌ها را می‌توان در اینجا گسترش داد
    },
  },
  plugins: [],
};
